; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v2 ?v9)
             (pred_12 ?v3 ?v13)
             (pred_5 ?v2 ?v13)
             (pred_10 ?v8 ?v2 )
	     (pred_1 ?v2)
             (pred_8 ?v12)
             (pred_11 ?v3)
             (pred_3 ?v13)
             (pred_4 ?v2)
             (pred_9 ?v3)
             (pred_7 ?v2)
             (pred_6 ))



(:action op_5
:parameters (?v5 ?v1 ?v10 ?v7)
:precondition (and (pred_8 ?v5) (pred_8 ?v1) (pred_11 ?v10) (pred_3 ?v7)
          (pred_2 ?v5 ?v1) (pred_12 ?v10 ?v7)
                   (pred_5 ?v1 ?v7) (pred_1 ?v5) 
                   (pred_4 ?v1) (pred_9 ?v10))
:effect (and  (pred_7 ?v1) (not (pred_4 ?v1))))


(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_8 ?v5) (pred_8 ?v6)
               (pred_1 ?v5) (pred_2 ?v5 ?v6) (pred_7 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v5))))

(:action op_3
:parameters (?v5 ?v10)
:precondition (and (pred_8 ?v5) (pred_11 ?v10) 
                  (pred_1 ?v5) (pred_10 ?v10 ?v5) (pred_6 ))
:effect (and (pred_9 ?v10)
   (not (pred_10 ?v10 ?v5)) (not (pred_6 ))))


(:action op_2
:parameters (?v5 ?v11 ?v4)
:precondition (and (pred_8 ?v5) (pred_11 ?v11) (pred_11 ?v4)
                  (pred_1 ?v5) (pred_9 ?v4) (pred_10 ?v11 ?v5))
:effect (and (pred_9 ?v11) (pred_10 ?v4 ?v5)
        (not (pred_9 ?v4)) (not (pred_10 ?v11 ?v5))))

(:action op_4
:parameters (?v5 ?v10)
:precondition (and (pred_8 ?v5) (pred_11 ?v10) 
                  (pred_1 ?v5) (pred_9 ?v10))
:effect (and (pred_6 ) (pred_10 ?v10 ?v5) (not (pred_9 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_13 obj_21 obj_10 obj_02 obj_22 obj_09 obj_01 obj_03 obj_16 obj_04 obj_07 obj_20 obj_17 obj_08 obj_11
    obj_18 obj_14 obj_12
    obj_15 obj_05 obj_19
    )

    (:init
       (pred_6)

       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_21)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_3 obj_18)
       (pred_3 obj_14)
       (pred_3 obj_12)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_19)

       (pred_2 obj_06 obj_02)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_13 obj_22)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_21 obj_10)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_21)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_09 obj_04)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_04 obj_08)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_17 obj_08)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_08 obj_04)
       (pred_2 obj_08 obj_17)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_08)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_01)
       (pred_5  obj_17 obj_18)
       (pred_5  obj_04 obj_14)
       (pred_5  obj_01 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_22)
       (pred_7 obj_09)
       (pred_7 obj_03)
       (pred_7 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_11)

       (pred_12  obj_15 obj_18)
       (pred_12  obj_05 obj_14)
       (pred_12  obj_19 obj_12)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_19 obj_22)
       (pred_1 obj_03)
    )

    (:goal (and
       (pred_10 obj_19 obj_10)
    ))
(:constraints
  (always (not (pred_1 obj_02)))
)
)

; plan
1. (op_1 obj_03 obj_16)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_16)
   goals met: 0 of 1
2. (op_1 obj_16 obj_22)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_22)
   goals met: 0 of 1
3. (op_3 obj_22 obj_19)
   deleted: (pred_10 obj_19 obj_22) (pred_6)
   added: (pred_9 obj_19)
   goals met: 0 of 1
4. (op_1 obj_22 obj_13)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_21)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_21)
   goals met: 0 of 1
6. (op_1 obj_21 obj_10)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_10)
   goals met: 0 of 1
7. (op_2 obj_10 obj_05 obj_19)
   deleted: (pred_9 obj_19) (pred_10 obj_05 obj_10)
   added: (pred_9 obj_05) (pred_10 obj_19 obj_10)
   goals met: 1 of 1
